#include "delay.h"

/**************************************************************************************
 * 描  述 : 毫秒延时
 * 入  参 : dly:延时参数，值越大，延时时间越长
 * 返回值 : 无
 **************************************************************************************/
void Delay::delay_us(unsigned short us) {
	unsigned short i;

	do {
		i = 22;
		asm("nop");
		asm("nop");
		asm("nop");
		while (i--)
			asm("nop");
		//__nop();
	} while (--us);
}
/**************************************************************************************
 * 描  述 : 毫秒延时
 * 入  参 : dly:延时参数，值越大，延时时间越长
 * 返回值 : 无
 **************************************************************************************/
void Delay::delay_ms(unsigned short ms) {
	do {
		delay_us(250);
		delay_us(250);
		delay_us(250);
		delay_us(250);
	} while (--ms);
}
